// Напишите программу, которая выводит массив из 8 элементов, заполненный случайными числами. 
//Оформите заполнение массива и вывод в виде функции (пригодится в следующих задачах).  Реализовать через функции. 
//(* Доп сложность, “введите количество элементов массива”, “Введите минимальный порог случайных значений”, “Введите максимальный порог случайных значений”)

System.Console.WriteLine("Введите размер массива (N): ");
int N = Convert.ToInt32(Console.ReadLine());
int[] randomArray = new int[N];

for (int i = 0; i < N; i++)
{
    randomArray[i] = new Random().Next(10, 1000);
    Console.Write(randomArray[i] + "  ");
}